import json

import parseTenhou
from mahjong.MahjongTransfer import MahjongTransfer
from mahjong.util.MAJING_CONSTANT import SOUTH, EAST, A_RULE

if __name__ == "__main__":
    teststr = """{"title":["第39期十段位決定戦","日本プロ麻雀連盟公式ルール"],"name":["魚谷侑未","浜上文吾","荒正義","近藤久春"],"rule":{
    "disp":"第39期十段位決定戦2","aka":0},"log":[[[7,0,0],[26700,21500,48000,23800],[28],[],[21,22,24,28,27,26,37,38,46,42,
    12,18,43],[43,34,42,15,15,14,27,32,37,33,13,45,23,31,31,25,"c242325",18],[46,42,60,12,34,15,24,60,22,60,21,37,37,
    60,45,38,31,27],[26,24,23,19,17,16,12,45,46,47,47,35,39],[19,23,41,32,27,46,44,11,17,38,29,21,15,47,44,17,27,33,
    "4646p46"],[39,35,26,60,60,24,23,23,44,60,60,60,41,45,60,19,19,27,33],[44,29,25,18,42,36,39,14,13,12,32,47,43],
    [14,19,29,26,13,11,21,38,45,45,33,23,11,"p454545",13,46,16,"c272526",41],[39,43,42,47,44,32,11,18,19,21,60,36,60,
    38,23,29,29,46,60],[31,43,22,28,35,36,44,24,42,16,11,15,35],[36,41,14,36,29,39,17,26,24,34,38,"c333435",34,39,37,
    22,25,34,16],[42,31,11,43,44,60,41,17,29,22,60,35,60,60,60,60,24,60,28],["全員聴牌"]]]} """

    kyoku = json.loads(teststr)
    parseTenhou.parseKyoku(kyoku['log'], A_RULE)
    # transfer = MahjongTransfer([14, 15, 16, 18, 18, 24, 25, 26, 35, 35, 35, 43, 43, 18], [], 18)
    # transfer.ronFormat = 'Z'
    # group = transfer.toMahjongGroup()
    # for g in group:
    #     g.setSpecial(EAST, SOUTH, isRiichi=True)
    #     g.setDora([42], [])
    #     g.finalCheck()
    #     print(g)
    #     print("=================")
    #
    # group.sort(key=lambda x: (x.score, x.fan, x.fu), reverse=True)
    # print(group[0])
